for index,i in enumerate(a):
         print("インデックス:{0}?値{1}".format(index,i))


'''
1 2 3(数値情報) 4

'埼玉県\t熊谷    40.9\t2007-08-16\n'

数値情報(41...)+インデックス(index 0...)
index を 数値情報の大きさ別に並べる(ソートする) 。

4,5,1,8,2....→辞書型にする?
インデックス(キー)をもとにソート

In [66]: dct = sorted(dct.values())

In [67]: dct
Out[67]: ['aaaa', 'awww', 'bbb']

values を入れ直す。


 for line in lists:
        line = line.split('\t')
        print(line)
'''

lists =  make_list( path_I)
sort_target = []

for line in lists:
        line = line.split('\t')
        sort_target.append(line[2])
        print(line[2])
else:
    print(sort_target)
    

dictionary = dict(zip(sort_target,lists))

print(dictionary)

sort_dict = sorted(dictionary)
print(sort_dict)



[['高知県', '江川崎', '41', '2013-08-12\n'],
 ['埼玉県', '熊谷', '40.9', '2007-08-16\n'],
 ['岐阜県', '多治見', '40.9', '2007-08-16\n'],
 ['山形県', '山形', '40.8', '1933-07-25\n'],
 ['山梨県', '甲府', '40.7', '2013-08-10\n'],
 ['和歌山県', 'かつらぎ', '40.6', '1994-08-08\n'],
 ['静岡県', '天竜', '40.6', '1994-08-04\n'],
 ['山梨県', '勝沼', '40.5', '2013-08-10\n'],
 ['埼玉県', '越谷', '40.4', '2007-08-16\n'],
 ['群馬県', '館林', '40.3', '2007-08-16\n'],
 ['群馬県', '上里見', '40.3', '1998-07-04\n'],
 ['愛知県', '愛西', '40.3', '1994-08-05\n'],
 ['千葉県', '牛久', '40.2', '2004-07-20\n'],
 ['静岡県', '佐久間', '40.2', '2001-07-24\n'],
 ['愛媛県', '宇和島', '40.2', '1927-07-22\n'],
 ['山形県', '酒田', '40.1', '1978-08-03\n'],
 ['岐阜県', '美濃', '40', '2007-08-16\n'],
 ['群馬県', '前橋', '40', '2001-07-24\n'],
 ['千葉県', '茂原', '39.9', '2013-08-11\n'],
 ['埼玉県', '鳩山', '39.9', '1997-07-05\n'],
 ['大阪府', '豊中', '39.9', '1994-08-08\n'],
 ['山梨県', '大月', '39.9', '1990-07-19\n'],
 ['山形県', '鶴岡', '39.9', '1978-08-03\n'],
 ['愛知県', '名古屋', '39.9', '1942-08-02']]



In [87]: pref = []
     
     for l in lists:
         pref.append(l[0])
         

In [88]: 

In [88]: pref
Out[88]: 
['高知県',
 '埼玉県',
 '岐阜県',
 '山形県',
 '山梨県',
 '和歌山県',
 '静岡県',
 '山梨県',
 '埼玉県',
 '群馬県',
 '群馬県',
 '愛知県',
 '千葉県',
 '静岡県',
 '愛媛県',
 '山形県',
 '岐阜県',
 '群馬県',
 '千葉県',
 '埼玉県',
 '大阪府',
 '山梨県',
 '山形県',
 '愛知県']

 pref = []
     
     for l in lists:
         pref.append(l[0])
     lists_counter = Counter(pref)
     
     

In [90]: lists_counter
Out[90]: 
Counter({'高知県': 1,
         '埼玉県': 3,
         '岐阜県': 2,
         '山形県': 3,
         '山梨県': 3,
         '和歌山県': 1,
         '静岡県': 2,
         '群馬県': 3,
         '愛知県': 2,
         '千葉県': 2,
         '愛媛県': 1,
         '大阪府': 1})

In [91]: lists_counter.most_common
Out[91]: <bound method Counter.most_common of Counter({'埼玉県': 3, '山形県': 3, '山梨県': 3, '群馬県': 3, '岐阜県': 2, '静岡県': 2, '愛知県': 2, '千葉県': 2, '高知県': 1, '和歌山県': 1, '愛媛県': 1, '大阪府': 1})>

In [92]: lists_counter.most_common()
Out[92]: 
[('埼玉県', 3),
 ('山形県', 3),
 ('山梨県', 3),
 ('群馬県', 3),
 ('岐阜県', 2),
 ('静岡県', 2),
 ('愛知県', 2),
 ('千葉県', 2),
 ('高知県', 1),
 ('和歌山県', 1),
 ('愛媛県', 1),
 ('大阪府', 1)]

In [93]: common = lists_counter.most_common()



In [113]:  if a in dct_common.keys():
          a = dct_common[a]
        

In [114]: 

In [114]: a
Out[114]: 3


 for i in lists:
         if i[0] in dct_common.keys():
             i.insert(0,dct_common[i[0]])
     


